package com.itstep.string.array.huk_homework;

/*2. Написать программу которая считает корни дифференциального уравнения.*/

import java.util.Scanner;

public class DifferentialEquationSqrtDiamond {
    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);
        System.out.println("Enter a positive integer num: ");
        int num = sc.nextInt();

    }
}
