package com.itstep.string.array.huk_classwork;

public class StringTask {
    public static void main(String[] args) {
        String s = "value";
        if (s.equals("Value")) {
            System.out.println("yes");
        }
        else{
            System.out.println("not equals");
        }


        //frequently used methods// обьекта класса стринг
        //        s.equals()-сравнивает строки с учетом регистра
        //        s.equalsIgnoreCase(): сравнивает строки посимвольно без учета регистра
        //        s.contains() - ищет совпадения
        //        s.substring() - возвращает подстроку, начиная с определенного индекса до конца или до определенного индекса
        //        s.endsWith() - определяет, заканчивается ли строка на определенную подстроку
        //        s.startWith() - определяет, начинается ли строка с подстроки
        //        s.isEmpty() - пустая ли строка
        //        s.replace() - подмена, замена символа либо подстроки надругую строку
        //        s.indexOf() - находит индекс первого вхождения подстроки в строку
        //        s.intern() - принудительное добавление строки в pool кеш
        //        s.toCharArray() - возвращает массив символов,делит строку на символы и добавляет в массив
        //        s.chatAt() - возвращает символ строки по индексу, вернет букву по заданной букве
        //        s.length() - длина строки начинаеться с 1ки
        //        s.split() - разделяет строку по символу по каждому
    }

}
